{
    "dinosaurs": {
        "herbivores": {
            "triceratops": {
                "location": "Western North America",
                "period": "Late Cretaceous",
                "species": [
                    "Triceratops Horridus",
                    "Triceratops Prorsus"
                ],
                "diet": "Herbivore",
                "description": "Triceratops, one of the most recognized and beloved dinosaurs out of all. It's name means 'Three-horned face', derived from the greek words 'trí', 'kéras' and 'ṓps' meaning 'three', 'horn' and 'face' respectively. Standing at over 3 meters tall and over 8 meters in length, the Triceratops could weigh up to 10 metric tons, so the same weight as 4-5 cars. On top of that, it's iconic horns could grow to be over a meter in length. It will eat almost any plant, with the exeption of ferns and palms."
            },
            "brachiosaurus": {
                "location": "North America",
                "period": "Late Jurassic",
                "species": [
                    "Brachiosaurus Altithorax"
                ],
                "diet": "Herbivore",
                "description": "Being over 13 meters when standing fully upright, Brachiosaurus is far and away the largest dinosaur found in Jurassic Park. The word 'Brachiosaurus' means 'arm lizard' in latin, referring to the fact that brachiosaurus has larger forelimbs rather than larger hindlimbs. Due to this, It's torso is angled upwards quite significantly. The second part of it's name, 'Altithorax', means 'deep chest', referring to the relatively large and deep chest the Brachiosaurus had compared to most other sauropods. Because Brachiosaurus weighed around 30 tonnes, it had to eat around 300 kilogram of plants like conifers and tree ferns. This is so much that it has to eat for around 15 hours every day just to sustain itself."
            },
            "gallimimus": {
                "location": "Mongolia",
                "period": "Late Cretaceous",
                "species": [
                    "Gallimimus Bullatus"
                ],
                "diet": "Omnivore",
                "description": "Originating from what is now the Gobi desert, the Gallimimus is the only dinosaur in Jurassic Park with feathers. On top of that, it is the only dinosaur in the park to have wings. Unfortunatly for them, they are unable to fly with them. Their wings are simply way to small to carry their 450 kilograms of body weight. The Gallimimus' name means 'chicken mimic' when translated from greek. this is based on the fact that teh closest living relatives to the Gallimimus are medium-sized landfowl like turkeys and peacocks. This connection is also the basis for statements like 'dinosaurs are birds' you might see floating around online. a Gallimimus feeds on both both plant and animal life, being an opportunistic omnivore eating both plants and smaller animals with a beak quite simulair to that of a duck."
            },
            "parasaurolophus": {
                "location": "Western North America, Asia",
                "period": "Late Cretaceous",
                "species": [
                    "Parasaurolophus Walkeri",
                    "Parasaurolophus Tubicen",
                    "Parasaurolophus Cyrtocristatus"
                ],
                "diet": "Herbivore",
                "description": "Parasaurolophus is one of very few dinosaurs that can walk both bipedal as well as quadrupedal. this allows it to both reach higher vegetation and gain the 'upper' hand in a potential encounter with smaller predators. The highest the over 5 tonnes weighing Parasaurolophus can reach is 4 meters. It uses a beak to lots of plants at a time, and uses large amounts of teeth in the back of it's mouth to grind and digest them. By far their most memorable feature is their large backwards cranial crest. The size and color of this crest differs between sex, and it is primarily used for sex identification and communicative sound amplification. Other theories about the crest included it being a snorkel for the Parasaurolophus, but this was disproven by the dinosaurs in our park."
            },
            "stegosaurus": {
                "location": "Western North America, Portugal",
                "period": "Late Jurassic",
                "species": [
                    "Stegosaurus Stenops",
                    "Stegosaurus Ungulatus",
                    "Stegosaurus Sulcatus"
                ],
                "diet": "Herbivore",
                "description": "The Stegosaurus is perhaps the single most recognizable dinosaurs when it comes to physical features alone. its rounded back, large hind limbs compared to their front counterparts, the spiked tail and most of all, the distictive kite-shaped upright plates on it's back. The Stegosaurus can grow to weigh up to 4 tonnes as well as being over four meters in height, including the plates. These plates can grow to be over 60 centimeters in length themselves. The tail spikes, also called 'Thagomizers' are generally between 60 and 90 centimeters long, and the Stegosaurus uses these spikes as a weapon against predators by pushing off the ground sideways with it's short put musculair front limbs, rotating on it's hind limbs and thus creating a powerful swing that can easily crush and pierce bones. In addition to this, the back plates stopped any attack from above, simply because a predator doesn't enjoy their mouthes being impaled."
            }
        },
        "carnivores": {
            "metriacanthosaurus": {
                "location": "United Kingdom",
                "period": "Late Jurassic",
                "species": [
                    "Metriacanthosaurus Parkeri"
                ],
                "diet": "Carnivore",
                "description": "The Metriacanthosaurus is on the small side for predators of it's time, being a maximum of 2 meters high. Due to this, it often hunted in packs of 3-4. This way, it could triumph over prey like the Stegosaurus, who is also found in our park!. Metriacanthosaurus means 'moderate spine lizard', referring to it's spine being relatively large compared to it's body and other predators of it's size, but still being smaller than those of a larger predators like the Allosaurus. If you listen closely, you might be able to hear them communicate with eachother when you are near the north dock"
            },
            "dilophosaurus": {
                "location": "North America",
                "period": "Early Jurassic",
                "species": [
                    "Dilophosaurus Wetherilli"
                ],
                "diet": "Carnivore",
                "description": "Dilophosaurus, meaning 'Two-crested lizard', was one of the first dinosaurs to be brought back to life in the labs of Jurassic Park. It's name refers to the two crests it has on its head, going from the nose all the way to above the eyes. these frills are quite simulair to those found on cassowaries. Standing at an average of around 2 meters tall and weighing over 300 kilograms, the Dilophosaurus is a scavanger rather than a predator, feeding off weak and small dinosaurs to survive. It also has a considerably weaker bite force compared to other carnivores of it's time. This is because rather than biting, the Dilophosaurus attacked with large claws on it's hands and feet."
            },
            "tyrannosaurus": {
                "location": "Western North America",
                "period": "Late Cretaceous",
                "species": [
                    "Tyrannosaurus Rex",
                    "Tyrannosaurus Mcraeensis"
                ],
                "diet": "Carnivore",
                "description": "When you think of a dinosaur, chances are you think of a Tyrannosaurus, and while the T. rex was long deemed the only species, recently scientist found evidence for a second species of tyrannosaurus; the T. mcraeensis. With it's name meaning 'tyrant lizard king', the tyrannosaurus was one of the last dinosaur species alive, only living in the time period right before the great dinosaur extiction. growing to almost 5 meters in height, the Tyrannosaurus was of the largest dinosaurs of its time, as well as it being the largest predator in our park. The bite force of the tyrannosaurus is unmatched, with it having the highest bite force of any terrestrial animal that has ever lived. It's jaws could even open up to 80 degrees! And even though the forearms are very small compared to the rest of it's body mass, they were very strong, being able to hold down struggling prey whilst the Tyrannosaurus used it's bone-crushing bite to eliminate it's prey."
            },
            "velociraptor": {
                "location": "Asia",
                "period": "Late Cretaceous",
                "species": [
                    "Velociraptor Mongoliensis",
                    "Velociraptor Osmolskae"
                ],
                "diet": "Carnivore",
                "description": "The velociraptor is a well-known predator, being one of the most famous dinosaurs in our park. It grows to a height of around 2.5 meters, and usually hunts in pack in order to take down large foes. It's most common prey were smaller sauropods, like the Apatosaurus. Despite this, the most famous fossil found of a Velociraptor is one where it was fighting a Protoceratops when both got buried in sand, likely because of a collapsing dune. The raptor also had considerable jumping skills, being able to clear five meters without too much trouble. this helped with getting on top of it's prey, where the victim would not have been able to reach the Velociraptor all to easily."
            },
            "baryonyx": {
                "location": "United Kingdom",
                "period": "Early Cretaceous",
                "species": [
                    "Baryonyx Walkeri"
                ],
                "diet": "Carnivore",
                "description": "Baryonyx, meaning 'heavy claw', is a unique predator in our park that specialized in fishing. Standing about 3 meters tall and weighing around 2 tonnes, this distinctive dinosaur had a crocodile-like snout filled with 96 sharp teeth perfect for catching fish. Its most notable feature is the massive 35-centimeter claw on each hand, which it used like a gaff hook to spear fish from rivers and lakes. Unlike other carnivores in the park, Baryonyx spent much of its time near water sources, making it semi-aquatic. You can often spot them near the river cruise route, where they demonstrate their remarkable fishing abilities."
            },
            "proceratosaurus": {
                "location": "United Kingdom",
                "period": "Middle Jurassic",
                "species": [
                    "Proceratosaurus Bradleyi"
                ],
                "diet": "Carnivore",
                "description": "Proceratosaurus, meaning 'before the horned lizard', is one of the smaller predators in Jurassic Park, standing only about 1.5 meters tall and weighing around 100 kilograms. Despite its name suggesting a connection to horned dinosaurs, it's actually an early tyrannosaur ancestor. Its most distinctive feature is a small nasal horn on its snout, which was likely used for display purposes. Being relatively small, Proceratosaurus hunted smaller prey and scavenged when opportunities arose. Its lightweight build made it incredibly fast and agile, able to chase down quick prey that larger predators couldn't catch. Visitors on the river cruise often get excellent views of these nimble hunters as they move through the forested areas of their enclosure."
            },
            "segisaurus": {
                "location": "Western North America",
                "period": "Early Jurassic",
                "species": [
                    "Segisaurus Halli"
                ],
                "diet": "Carnivore",
                "description": "Segisaurus, named after the Segi Canyon where it was first discovered, is the smallest carnivore in Jurassic Park. Standing barely 1 meter tall and weighing only about 10 kilograms, this tiny predator is roughly the size of a large chicken. Despite its small stature, Segisaurus was an efficient hunter of insects, small lizards, and early mammals. Its long, powerful legs made it incredibly fast, capable of reaching speeds of up to 40 kilometers per hour when chasing prey or fleeing from larger predators. What makes Segisaurus unique among dinosaurs is that it had solid leg bones rather than hollow ones, making it more robust despite its small size. These delightful little dinosaurs can often be seen darting between the legs of larger herbivores in mixed enclosures."
            }
        },
        "flying": {
            "pteranodon": {
                "location": "North America",
                "period": "Late Cretaceous",
                "species": [
                    "Pteranodon Longiceps",
                    "Pteranodon Sternbergi"
                ],
                "diet": "Carnivore",
                "description": "Pteranodon, meaning 'wing without tooth', is technically not a dinosaur but a pterosaur - a flying reptile that lived alongside dinosaurs. With a wingspan reaching up to 7 meters, Pteranodon is one of the most impressive aerial creatures in Jurassic Park. Despite having no teeth, its long, sharp beak was perfectly adapted for catching fish by diving into water from great heights. The distinctive backward-pointing crest on its head served multiple purposes: helping with aerodynamics during flight, acting as a rudder for steering, and displaying to potential mates. Male Pteranodons typically have larger crests than females. These magnificent flyers can often be seen soaring over the park's waterways, occasionally diving down to snatch fish from the surface in spectacular displays that never fail to amaze visitors."
            }
        }
    },
    "buildings": {
        "visitor_center": {
            "description": "The Visitor Center is one of the most important builings in the entire park. It's interior is round, with every quarter having a use. In the center, there's skeletal statues of a Tyrannosaurus and a Alamosaurus for the exhibition 'When Dinosaurs ruled the Earth. It is used for all kinds of things: being the central hub for visitors, being the biggest dining service on the island, having the garage for the tour cars and employee cars as well as containing the park's control room in an area restricted to visitors.",
            "capacity": 1000,
            "type": "entertainment"
        },
        "safari_lodges": {
            "description": "The Safari Lodge is a hotel for vistors who wish to stay overnight rather than visit the park for a single night. The hotel located at the west side of the park, with a beautiful view over a lush safari zone. Visitors can stay at the hotel for a maximum of three nights, and the hotel offers breakfast and dining accommodations.",
            "capacity": 300,
            "type": "accommodation"
        },
        "tour_station": {
            "description": "At the tour station, take a seat in one of our fifteen Ford Explorer XLT automated tour cars for a tour throughout the park. These touring cars a locked to a electric railgrid, and thus don't need any drivers to pilot the car. Take a close look at some of our largest and most dangerous carnivores, and pass through the territories of the friendly herbivores. Because the cars drive automatically, you enter and exit the touring car at the tour station.",
            "capacity": 75,
            "type": "entertainment"
        },
        "river_cruise": {
            "description": "Step aboard our exiting River Cruise, a river attraction going through the areas of the Pteranodon, Stegosaurus, Brachiosaurus, Parasaurolophus and Proceratosaurus. Get close with the herbivores, whilst being able to look at the Pteranodon and Proceratosaurus without any glass. You are required to leave your bags at the station, because we will not allow visitors to bring food etc. near the dinosaurs.",
            "capacity": 600,
            "type": "entertainment"
        },
        "helicopter_platform": {
            "description": "This is the helicopter platform of Jurassic Park. The helipad is only used for medical emergencies, VIP guests and John Hammond himself. In case you were wondering, the helicopters used by Jurassic Park are two Agusta A-109A helicopters.",
            "capacity": 15,
            "type": "transport"
        },
        "toilet": {
            "description": "There are multiple toilets located around the park, each being decorated in the Jurassic Park style.",
            "capacity": 60,
            "type": "accommodation"
        }
    }
}